arendst/Tasmota/tasmota/include/tasmota_configurations_ESP32.h
#define FIRMWARE_MINIMAL

#undef USE_ESP32_SENSORS
#undef USE_UFILESYS
#undef GUI_TRASH_FILE
#undef GUI_EDIT_FILE
#undef USE_PING
#undef USE_AUTOCONF
#undef USE_BERRY

#define USE_TLS
#define USE_WEBSERVER

#undef USE_ESP32_WDT                                  // disable watchdog on SAFEBOOT until more testing is done

#if CONFIG_FREERTOS_UNICORE || CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32P4
#if CONFIG_ETH_ENABLED                               // Check for Ethernet support in Arduino libs
//  #undef USE_MQTT_TLS
//  #define USE_SERIAL_BRIDGE                        // Add support for software Serial Bridge console Tee (+4.5k code)
  #define USE_SPI                                    // Make SPI Ethernet adapters useable (+124 bytes)
  #define USE_ETHERNET
#endif  // CONFIG_ETH_ENABLED
#endif  // CONFIG_FREERTOS_UNICORE || CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32P4

#endif  // FIRMWARE_SAFEBOOT

/*********************************************************************************************\
 * [tasmota32-webcam.bin]
 * Provide an image with useful supported sensors enabled
\*********************************************************************************************/

#ifdef FIRMWARE_WEBCAM

#ifndef CODE_IMAGE_STR
  #define CODE_IMAGE_STR "webcam"
#endif

#define USE_WEBCAM
  #define USE_WEBCAM_V2
  #define ENABLE_RTSPSERVER
#define USE_SPI
#define USE_SDCARD

#define USE_I2C
#undef USE_HOME_ASSISTANT
#define USE_TASMOTA_DISCOVERY                    // Enable Tasmota Discovery support (+2k code)
#undef USE_DOMOTICZ
#undef USE_SERIAL_BRIDGE
#undef ROTARY_V1
#undef USE_IR_REMOTE
#undef USE_ADC
#undef USE_AC_ZERO_CROSS_DIMMER
#undef USE_PWM_DIMMER
#undef USE_PWM_DIMMER_REMOTE
#undef USE_TUYA_MCU
#undef USE_EMULATION_HUE
#undef USE_EMULATION_WEMO
#undef USE_BUZZER
#undef USE_ARILUX_RF
#undef USE_DS18x20
#undef USE_BMP
#undef USE_DHT
#undef USE_BH1750
#undef USE_WS2812
#undef USE_ENERGY_SENSOR
#undef USE_SHUTTER
#undef USE_DEVICE_GROUPS
//#undef USE_BERRY                                 // Disable Berry scripting language
#undef USE_MI_ESP32                             // (ESP32 only) Disable support for ESP32 as a BLE-bridge (+9k2 mem, +292k flash)
#undef USE_BLE_ESP32
#endif  // FIRMWARE_WEBCAM

/*********************************************************************************************\
 * [tasmota32-bluetooth.bin]
 * Provide an image with BLE support
\*********************************************************************************************/

#ifdef FIRMWARE_BLUETOOTH

#ifndef CODE_IMAGE_STR
  #define CODE_IMAGE_STR "bluetooth"
#endif

#define CONFIG_NIMBLE_CPP_IDF 1

#undef MODULE
#define MODULE                 WEMOS             // [Module] Select default module from tasmota_template.h
#undef FALLBACK_MODULE
#define FALLBACK_MODULE        WEMOS             // [Module2] Select default module on fast reboot where USER_MODULE is user template

#define USE_INFLUXDB                             // Enable influxdb support (+5k code)
#undef USE_HOME_ASSISTANT
#define USE_TASMOTA_DISCOVERY

#define USE_SDCARD

#ifndef USE_BERRY_ULP                              // potential performance gains with ULP
  #define USE_ADC                                  // so do not use common ADC funtions in that case
#endif
//#undef USE_BERRY                                 // Disable Berry scripting language

#define USE_ETHERNET                             // Add support for ethernet (+20k code)
#ifndef USE_MI_EXT_GUI
  #define USE_BLE_ESP32                            // Enable full BLE driver
  #define USE_EQ3_ESP32
#endif // USE_MI_EXT_GUI
#define USE_MI_ESP32                             // (ESP32 only) Add support for ESP32 as a BLE-bridge (+9k2 mem, +292k flash)

#endif  // FIRMWARE_BLUETOOTH

/*********************************************************************************************\
 * [tasmota32-lvgl.bin]
 * Provide an image which includes uDisplay and LVGL driver
\*********************************************************************************************/

#ifdef FIRMWARE_LVGL

#ifndef CODE_IMAGE_STR
  #define CODE_IMAGE_STR "lvgl-haspmota"
#endif

#undef MODULE
#define MODULE                 WEMOS             // [Module] Select default module from tasmota_template.h
#undef FALLBACK_MODULE
#define FALLBACK_MODULE        WEMOS             // [Module2] Select default module on fast reboot where USER_MODULE is user template

#define USE_MATTER_DEVICE
#undef USE_DOMOTICZ
#undef USE_HOME_ASSISTANT
#define USE_TASMOTA_DISCOVERY                    // Enable Tasmota Discovery support (+2k code)

#define USE_I2S
#define USE_SPI
#define USE_LVGL
  #undef SET_ESP32_STACK_SIZE
  #define SET_ESP32_STACK_SIZE (24 * 1024)
#define USE_DISPLAY
#define USE_MPU_ACCEL
#define USE_RTC_CHIPS                            // Enable RTC chip support and NTP server - Select only one
  #define USE_BM8563
#define USE_MLX90614
#define USE_UNIVERSAL_DISPLAY
#define USE_UNIVERSAL_TOUCH
//#define USE_XPT2046
//#define USE_FT5206
//#define USE_GT911
//#define USE_CST816S
#define USE_DISPLAY_LVGL_ONLY

//#undef USE_DISPLAY_MODES1TO5
#undef USE_DISPLAY_LCD
#undef USE_DISPLAY_MATRIX
#undef USE_DISPLAY_SEVENSEG

#define USE_ENHANCED_GUI_WIFI_SCAN

#define USE_SDCARD

#define ROTARY_V1                                // Add support for Rotary Encoder as used in MI Desk Lamp

#define USE_TUYA_MCU                             // Add support for Tuya Serial MCU
#ifndef TUYA_DIMMER_ID
  #define TUYA_DIMMER_ID       0                 // Default dimmer Id
#endif
#undef USE_ARMTRONIX_DIMMERS                    // Disable support for Armtronix Dimmers (+1k4 code)
//#undef USE_PS_16_DZ                             // Disable support for PS-16-DZ Dimmer (+2k code)
#undef USE_SONOFF_IFAN                          // Disable support for Sonoff iFan02 and iFan03 (+2k code)
#define USE_BUZZER                               // Add support for a buzzer (+0k6 code)
//#undef USE_ARILUX_RF                            // Disable support for Arilux RF remote controller (+0k8 code, 252 iram (non 2.3.0))
//#define USE_DEEPSLEEP                            // Add support for deepsleep (+1k code)
#undef USE_EXS_DIMMER                           // Disable support for EX-Store WiFi Dimmer
//#define USE_HOTPLUG                              // Add support for sensor HotPlug
//#undef USE_DEVICE_GROUPS                        // Disable support for device groups (+5k6 code)
#undef USE_PWM_DIMMER                           // Disable support for MJ-SD01/acenx/NTONPOWER PWM dimmers (+4k5 code)
#undef USE_KEELOQ                               // Disable support for Jarolift rollers by Keeloq algorithm (+4k5 code)
#undef USE_SONOFF_D1                            // Disable support for Sonoff D1 Dimmer (+0k7 code)
#undef USE_SHELLY_DIMMER                        // Disable support for Shelly Dimmer (+3k code)

#define USE_LIGHT_PALETTE                        // Add support for color palette (+0k9 code)
#undef USE_EMULATION_WEMO
//#undef USE_EMULATION_HUE

#define USE_WS2812

#define USE_DS18x20                              // Add support for DS18x20 sensors with id sort, single scan and read retry (+1k3 code)

